Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Сделка</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПозицииИнструментов</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыеРезультатыПоСделкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ФинансовыеРезультатыПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ФинансовыеРезультатыПоСделкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрибыльУбыток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Сделка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заполнение ВТ Позиции
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаПозиции.НомерСтроки КАК НомерСтроки,
	|	СделкаПозиции.Инструмент КАК Инструмент,
	|	СделкаПозиции.Количество КАК Количество,
	|	СделкаПозиции.Цена КАК Цена,
//		|	СделкаПозиции.ВалютаСделки КАК ВалютаСделки,
	|	СделкаПозиции.Комиссия КАК Комиссия
	|ПОМЕСТИТЬ Позиции
	|ИЗ
	|	&Позиции КАК СделкаПозиции
	|;
	|";
	Запрос.УстановитьПараметр("Позиции", Позиции.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();

	Движения.ПозицииИнструментов.Записывать = Истина;
	Если ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		
		// проверка наличия покупок по инструменту перед продажей
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Позиции.Инструмент КАК Инструмент,
		|	ЕСТЬNULL(ПозицииИнструментовОбороты.КоличествоПриход, 0) КАК КоличествоПриход
		|ИЗ
		|	Позиции КАК Позиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПозицииИнструментов.Обороты(
		|				,
		|				&Период,
		|				,
		|				Портфель = &Портфель
		|					И Инструмент В
		|						(ВЫБРАТЬ
		|							Позиции.Инструмент
		|						ИЗ
		|							Позиции)) КАК ПозицииИнструментовОбороты
		|		ПО (&Портфель = ПозицииИнструментовОбороты.Портфель)
		|			И Позиции.Инструмент = ПозицииИнструментовОбороты.Инструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
		|		ПО Позиции.Инструмент = Инструменты.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиции.НомерСтроки";
		
		Запрос.УстановитьПараметр("Период", МоментВремени());
		Запрос.УстановитьПараметр("Портфель", Портфель);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоПриход = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По инструменту %1 в портфеле %2 ещё не было покупок!", Выборка.Инструмент, Портфель), ЭтотОбъект,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		// Заполнение движений при продаже
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК КурсВалюты
		|ПОМЕСТИТЬ втКурсВалюты
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Позиции.Цена * втКурсВалюты.КурсВалюты КАК ЦенаПродажи,
		|	Позиции.Количество КАК Количество,
		|	Позиции.Комиссия * втКурсВалюты.КурсВалюты КАК Комиссия,
		|	Позиции.Инструмент КАК Инструмент,
		|	ЕСТЬNULL(ПозицииИнструментовОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПозицииИнструментовОстатки.КоличествоОстаток = 0
		|				ТОГДА 0
		|			ИНАЧЕ ПозицииИнструментовОстатки.СтоимостьОстаток / ПозицииИнструментовОстатки.КоличествоОстаток
		|		КОНЕЦ, 0) КАК СредняяЦена,
		|	ЕСТЬNULL(ПозицииИнструментовОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток,
		|	Инструменты.РазмерЛота КАК РазмерЛота
		|ИЗ
		|	Позиции КАК Позиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПозицииИнструментов.Остатки(
		|				&Период,
		|				Портфель = &Портфель
		|					И Инструмент В
		|						(ВЫБРАТЬ
		|							Позиции.Инструмент
		|						ИЗ
		|							Позиции)) КАК ПозицииИнструментовОстатки
		|		ПО (&Портфель = ПозицииИнструментовОстатки.Портфель)
		|			И Позиции.Инструмент = ПозицииИнструментовОстатки.Инструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
		|		ПО Позиции.Инструмент = Инструменты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсВалюты КАК втКурсВалюты
		|		ПО (ИСТИНА)
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ПозицииИнструментов.Остатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиции.НомерСтроки";
		
		Запрос.УстановитьПараметр("Валюта", ВалютаСделки);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Движения.ФинансовыеРезультатыПоСделкам.Записывать = Истина;
		СтруктураОстатковПоИнструменту = Новый Структура("КоличествоОстаток, СтоимостьОстаток");
		ОстаткиПоИнструментам = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			
			ОстатокПоИнструменту = ОстаткиПоИнструментам.Получить(Выборка.Инструмент);
			Если ОстатокПоИнструменту = Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(СтруктураОстатковПоИнструменту, Выборка);
				ОстаткиПоИнструментам.Вставить(Выборка.Инструмент, СтруктураОстатковПоИнструменту);
				КоличествоОстатокПоИнструменту = Выборка.КоличествоОстаток;
				СтоимостьОстатокПоИнструменту = Выборка.СтоимостьОстаток;
				
			Иначе
			
				КоличествоОстатокПоИнструменту = ОстатокПоИнструменту.КоличествоОстаток;
				СтоимостьОстатокПоИнструменту = ОстатокПоИнструменту.СтоимостьОстаток;
				
			КонецЕсли;
			
			ЭтоЗакрытиеПозиции = КоличествоОстатокПоИнструменту = Выборка.Количество;
			Движение = Движения.ФинансовыеРезультатыПоСделкам.Добавить();
			Движение.Период = Дата;
			Движение.Портфель = Портфель;
			Движение.СтратегияСделки = СтратегияСделки;
			Движение.Инструмент = Выборка.Инструмент;
			Движение.Выручка = Выборка.ЦенаПродажи * Выборка.Количество;
			Если ЭтоЗакрытиеПозиции Тогда
				СебестоимостьСписано = СтоимостьОстатокПоИнструменту;
			Иначе
				СебестоимостьСписано = Выборка.СредняяЦена * Выборка.Количество;
			КонецЕсли;
			Движение.Себестоимость = СебестоимостьСписано;
			Движение.ПрибыльУбыток = Движение.Выручка - Движение.Себестоимость - Выборка.Комиссия;
			Движение.Комиссия = Выборка.Комиссия;
			
			Движение = Движения.ПозицииИнструментов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Портфель = Портфель;
			Движение.Инструмент = Выборка.Инструмент;
			Движение.Количество = Выборка.Количество;
			Если ЭтоЗакрытиеПозиции Тогда
				Движение.Стоимость = СтоимостьОстатокПоИнструменту;
			Иначе
				Движение.Стоимость = Выборка.СредняяЦена * Выборка.Количество;
			КонецЕсли;
			
			СтруктураОстатковПоИнструменту.КоличествоОстаток = КоличествоОстатокПоИнструменту - Выборка.Количество;
			СтруктураОстатковПоИнструменту.СтоимостьОстаток = СтоимостьОстатокПоИнструменту - СебестоимостьСписано;
			ОстаткиПоИнструментам.Вставить(Выборка.Инструмент, СтруктураОстатковПоИнструменту);
			
//			Если ЭтоЗакрытиеПозиции Тогда
//				
//				Отбор = Новый Структура("Портфель, Инструмент", Портфель, Выборка.Инструмент);
//				СостояниеПозиции = РегистрыСведений.СостояниеПозиции.Выбрать(, Дата, Отбор);
//				ЗакрытыеСделки = РегистрыСведений.ЗакрытыеСделки.СоздатьМенеджерЗаписи();
////				ЗакрытыеСделки.
//				
//			КонецЕсли;
			
		КонецЦикла;
		Движения.Записать();
		
		// контроль остатков
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииИнструментовОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПозицииИнструментовОстатки.Инструмент КАК Инструмент
		|ИЗ
		|	РегистрНакопления.ПозицииИнструментов.Остатки(
		|			&МоментВремени,
		|			Портфель = &Портфель
		|				И Инструмент В
		|					(ВЫБРАТЬ
		|						Позиции.Инструмент
		|					ИЗ
		|						Позиции)) КАК ПозицииИнструментовОстатки
		|ГДЕ
		|	ПозицииИнструментовОстатки.КоличествоОстаток < 0";
		
		ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка= РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Недостаточно количества позиций по инструменту %1. Не хватает %2", 
			Выборка.Инструмент,
			Выборка.КоличествоОстаток), ЭтотОбъект,,, Отказ);
			
		КонецЦикла;
		
	Иначе // покупка
		
		Для Каждого ТекСтрокаПозиции Из Позиции Цикл
			Движение = Движения.ПозицииИнструментов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Портфель = Портфель;
			Движение.Инструмент = ТекСтрокаПозиции.Инструмент;
			РазмерЛота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрокаПозиции.Инструмент, "РазмерЛота");
			Движение.Количество = ТекСтрокаПозиции.Количество;
			Движение.Стоимость = (ТекСтрокаПозиции.Количество * ТекСтрокаПозиции.Цена + ТекСтрокаПозиции.Комиссия) * РасчетыВДокументах.КурсВалютыНаДату(Дата, ВалютаСделки);
		КонецЦикла;
		Движения.Записать();
		
		//Запрос.УстановитьПараметр("Валюта", ВалютаСделки);
		//Выборка = ВыборкаПоОстаткам(Запрос);

		////Движения.ФинансовыеРезультатыПоСделкам.Записывать = Истина;
		////СтруктураОстатковПоИнструменту = Новый Структура("КоличествоОстаток, СтоимостьОстаток");
		////ОстаткиПоИнструментам = Новый Соответствие;
		//Пока Выборка.Следующий() Цикл
		//	
		//	Если Выборка.КоличествоОстаток = 0 Тогда
		//		
		//		// Открытие позиции
		//		НаборЗаписей = РегистрыСведений.СостояниеПозиции.СоздатьНаборЗаписей();
		//		Запись = НаборЗаписей.Добавить();
		//		Запись.ДатаОткрытия = Дата;
		//		Запись.Инструмент = Выборка.Инструмент;
		//		Запись.Количество = Выборка.Количество;
		//		Запись.Портфель = Портфель;
		//		Запись.ЦенаОткрытия = Выборка.Цена;
		//		
		//	//Иначе
		//	//	
		//	//	СостояниеПозиции = РегистрыСведений.СостояниеПозиции.СоздатьМенеджерЗаписи();
		//	//	СостояниеПозиции.Инструмент = Выборка.Инструмент;
		//	//	СостояниеПозиции.Портфель = Портфель;
		//	//	СостояниеПозиции.Прочитать();
		//	//	Если Не СостояниеПозиции.Выбран() Тогда
		//	//		Запись.ДатаОткрытия = Дата;
		//	//		Запись.Инструмент = Выборка.Инструмент;
		//	//		Запись.Количество = Выборка.Количество;
		//	//		Запись.Портфель = Портфель;
		//	//		Запись.ЦенаОткрытия = Выборка.Цена;
		//	//	Иначе
		//	//		Запись.ДатаОткрытия = Дата;
		//	//		Запись.Количество = Выборка.Количество;
		//	//		Запись.ЦенаОткрытия = Выборка.Цена;
		//	//	КонецЕсли;
		//	//	Курс.Записать();
		//		
		//	КонецЕсли;
		//	//ОстатокПоИнструменту = ОстаткиПоИнструментам.Получить(Выборка.Инструмент);
		//	//Если ОстатокПоИнструменту = Неопределено Тогда
		//	//	
		//	//	ЗаполнитьЗначенияСвойств(СтруктураОстатковПоИнструменту, Выборка);
		//	//	ОстаткиПоИнструментам.Вставить(Выборка.Инструмент, СтруктураОстатковПоИнструменту);
		//	//	КоличествоОстатокПоИнструменту = Выборка.КоличествоОстаток;
		//	//	СтоимостьОстатокПоИнструменту = Выборка.СтоимостьОстаток;
		//	//	
		//	//Иначе
		//	//
		//	//	КоличествоОстатокПоИнструменту = ОстатокПоИнструменту.КоличествоОстаток;
		//	//	СтоимостьОстатокПоИнструменту = ОстатокПоИнструменту.СтоимостьОстаток;
		//	//	
		//	//КонецЕсли;
		//	
		//	//Движение = Движения.ФинансовыеРезультатыПоСделкам.Добавить();
		//	//Движение.Период = Дата;
		//	//Движение.Портфель = Портфель;
		//	//Движение.СтратегияСделки = СтратегияСделки;
		//	//Движение.Инструмент = Выборка.Инструмент;
		//	//Движение.Выручка = Выборка.ЦенаПродажи * Выборка.Количество;
		//	//Если КоличествоОстатокПоИнструменту = Выборка.Количество Тогда
		//	//	СебестоимостьСписано = СтоимостьОстатокПоИнструменту;
		//	//Иначе
		//	//	СебестоимостьСписано = Выборка.СредняяЦена * Выборка.Количество;
		//	//КонецЕсли;
		//	//Движение.Себестоимость = СебестоимостьСписано;
		//	//Движение.ПрибыльУбыток = Движение.Выручка - Движение.Себестоимость - Выборка.Комиссия;
		//	//Движение.Комиссия = Выборка.Комиссия;
		//	//
		//	//Движение = Движения.ПозицииИнструментов.Добавить();
		//	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	//Движение.Период = Дата;
		//	//Движение.Портфель = Портфель;
		//	//Движение.Инструмент = Выборка.Инструмент;
		//	//Движение.Количество = Выборка.Количество;
		//	//Если КоличествоОстатокПоИнструменту = Выборка.Количество Тогда
		//	//	Движение.Стоимость = СтоимостьОстатокПоИнструменту;
		//	//Иначе
		//	//	Движение.Стоимость = Выборка.СредняяЦена * Выборка.Количество;
		//	//КонецЕсли;
		//	//
		//	//СтруктураОстатковПоИнструменту.КоличествоОстаток = КоличествоОстатокПоИнструменту - Выборка.Количество;
		//	//СтруктураОстатковПоИнструменту.СтоимостьОстаток = СтоимостьОстатокПоИнструменту - СебестоимостьСписано;
		//	//ОстаткиПоИнструментам.Вставить(Выборка.Инструмент, СтруктураОстатковПоИнструменту);
		//	
		//КонецЦикла;
		
	КонецЕсли;
	
	
	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Сделка") Тогда
		// Заполнение шапки
		ВидСделки = ?(ВидСделки = Перечисления.ВидыСделок.Продажа, Перечисления.ВидыСделок.Покупка, Перечисления.ВидыСделок.Продажа);
		Комментарий = ДанныеЗаполнения.Комментарий;
		ВалютаСделки = ДанныеЗаполнения.ВалютаСделки;
		Портфель = ДанныеЗаполнения.Портфель;
		СтратегияСделки = ДанныеЗаполнения.СтратегияСделки;
		Для Каждого ТекСтрокаПозиции Из ДанныеЗаполнения.Позиции Цикл
			НоваяСтрока = Позиции.Добавить();
			//НоваяСтрока.ВалютаСделкиУдалить = ТекСтрокаПозиции.ВалютаСделки;
			НоваяСтрока.Инструмент = ТекСтрокаПозиции.Инструмент;
			НоваяСтрока.КоличествоЛотов = ТекСтрокаПозиции.КоличествоЛотов;
			НоваяСтрока.Количество = ТекСтрокаПозиции.Количество;
			НоваяСтрока.Комиссия = ТекСтрокаПозиции.Комиссия;
			НоваяСтрока.Цена = ТекСтрокаПозиции.Цена;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() = Ложь Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Описание = "";
	ТЗПозиции = Позиции.Выгрузить(, "Инструмент");
	ТЗПозиции.Свернуть("Инструмент");
	Для Каждого СтрокаТ Из ТЗПозиции Цикл
		Описание = Описание + ?(ПустаяСтрока(Описание), "", ", ") + СтрокаТ.Инструмент;
	КонецЦикла;
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

Функция ВыборкаПоОстаткам(Запрос)

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК КурсВалюты
		|ПОМЕСТИТЬ втКурсВалюты
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Позиции.Цена КАК Цена,
		|	Позиции.Количество КАК Количество,
		|	Позиции.Комиссия * втКурсВалюты.КурсВалюты КАК Комиссия,
		|	Позиции.Инструмент КАК Инструмент,
		|	ЕСТЬNULL(ПозицииИнструментовОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПозицииИнструментовОстатки.КоличествоОстаток = 0
		|				ТОГДА 0
		|			ИНАЧЕ ПозицииИнструментовОстатки.СтоимостьОстаток / ПозицииИнструментовОстатки.КоличествоОстаток
		|		КОНЕЦ, 0) * втКурсВалюты.КурсВалюты КАК СредняяЦена,
		|	ЕСТЬNULL(ПозицииИнструментовОстатки.СтоимостьОстаток, 0) * втКурсВалюты.КурсВалюты КАК СтоимостьОстаток,
		|	Инструменты.РазмерЛота КАК РазмерЛота
		|ИЗ
		|	Позиции КАК Позиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПозицииИнструментов.Остатки(
		|				&Период,
		|				Портфель = &Портфель
		|					И Инструмент В
		|						(ВЫБРАТЬ
		|							Позиции.Инструмент
		|						ИЗ
		|							Позиции)) КАК ПозицииИнструментовОстатки
		|		ПО (&Портфель = ПозицииИнструментовОстатки.Портфель)
		|			И Позиции.Инструмент = ПозицииИнструментовОстатки.Инструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
		|		ПО Позиции.Инструмент = Инструменты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсВалюты КАК втКурсВалюты
		|		ПО (ИСТИНА)
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ПозицииИнструментов.Остатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиции.НомерСтроки";
		
		РезультатЗапроса = Запрос.Выполнить();
		Возврат РезультатЗапроса.Выбрать();

КонецФункции // ВыборкаПоОстаткам

#КонецОбласти
